const quizData = [
  { q: "‘मुदित महिपति मंदिर आए। सेवक सचिव सुमंत बुलाए’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(i) अनुप्रास अलंकार" },
  { q: "‘चरण-कमल बन्दों हरि राई।’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(iv) रूपक अलंकार" },
  { q: "‘सपना-सपना समझ कर भूल न जाना’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(ii) यमक अलंकार" },
  { q: "‘नील गगन-सा शांत हृदय था सो रहा।’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(iii) उपमा अलंकार" },
  { q: "‘आगे नदियां पड़ी अपार घोडा कैसे उतरे पार। राणा ने सोचा इस पार तब तक चेतक था उस पार।’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) यमक अलंकार", "(iii) अतिश्योक्ति अलंकार", "(iv) रूपक अलंकार"], a: "(iii) अतिश्योक्ति अलंकार" },
  { q: "‘फूल हँसे कलियाँ मुसकाई।’ में कौन सा अलंकार है।", o: ["(i) मानवीकरण अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(i) मानवीकरण अलंकार" },
  { q: "‘बंदौ गुरु पद पदुम परगा। सुरुचि सुबास सरस अनुरागा’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(i) अनुप्रास अलंकार" },
  { q: "‘मेघ आये बड़े बन-ठन के संवर के।’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) मानवीकरण अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(ii) मानवीकरण अलंकार" },
  { q: "‘तीन बेर खाती थी वो तीन बेर खाती है।’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) अतिश्योक्ति अलंकार", "(iii) उपमा अलंकार", "(iv) यमक अलंकार"], a: "(iv) यमक अलंकार" },
  { q: "‘हाय फूल सी कोमल बच्ची, हुई राख की ढेरी थी।’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(iii) उपमा अलंकार" },
  { q: "‘मैया मैं तो चंद्र-खिलौना लैहों।’ में कौन सा अलंकार है।", o: ["(i) अतिश्योक्ति अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(iv) रूपक अलंकार" },
  { q: "‘धनुष उठाया ज्यों ही उसने, और चढ़ाया उस पर बाण। धरा–सिन्धु नभ काँपे सहसा, विकल हुए जीवों के प्राण।’ में कौन सा अलंकार है।", o: ["(i) अतिश्योक्ति अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(i) अतिश्योक्ति अलंकार" },
  { q: "‘मेघमय आसमान से उतर रही है संध्या सुन्दरी परी सी धीरे धीरे धीरे।’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) यमक अलंकार", "(iii) मानवीकरण अलंकार", "(iv) रूपक अलंकार"], a: "(iii) मानवीकरण अलंकार" },
  { q: "‘चारु चंद्र की चंचल किरणें खेल रही थी जल थल में’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(i) अनुप्रास अलंकार" },
  { q: "‘मुख बाल रवि सम लाल होकर ज्वाला – सा हुआ बोधित।’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(iii) उपमा अलंकार" },
  { q: "‘माला फेरत जुग भया, मिटा न मनका फेर, कर का मनका डारि के मन का मनका फेर।’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(ii) यमक अलंकार" },
  { q: "‘वन शारदी चंद्रिका-चादर ओढ़े।’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(iv) रूपक अलंकार" },
  { q: "‘चंचला स्नान कर आये, चन्द्रिका पर्व में जैसे। उस पावन तन की शोभा, आलोक मधुर थी ऐसे।’ में कौन सा अलंकार है।", o: ["(i) अतिश्योक्ति अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(iii) उपमा अलंकार" },
  { q: "‘उषा सुनहरे तीर बरसाती, जय लक्ष्मी-सी उदित हुई।’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) मानवीकरण अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(ii) मानवीकरण अलंकार" },
  { q: "‘विमल वाणी ने वीणा ली ,कमल कोमल क्रमें सप्रीत।’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(i) अनुप्रास अलंकार" },
  { q: "‘दुख है जीवन-तरु के मूल।’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(iv) रूपक अलंकार" },
  { q: "‘कहै कवि बेनी, बेनी ब्याल की चुराई लानी।’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(ii) यमक अलंकार" },
  { q: "‘देख लो साकेत नगरी है यही। स्वर्ग से मिलने गगन में जा रही।’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) अतिश्योक्ति अलंकार"], a: "(iv) अतिश्योक्ति अलंकार" },
  { q: "‘कलियाँ दरवाज़े खोल खोल जब झुरमुट में मुस्काती हैं।’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) मानवीकरण अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(ii) मानवीकरण अलंकार" },
  { q: "‘रघुपति राघव राजा राम’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(i) अनुप्रास अलंकार" },
  { q: "‘कालिका सी किलकि कलेऊ देती काल को’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(i) अनुप्रास अलंकार" },
  { q: "‘आवत जात कुंज की गलियन रूप सुधा नित पीजै। गोपी पद-पंकज पावन की रज जामे भीजै।’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(iv) रूपक अलंकार" },
  { q: "‘रति-रति शोभा सब रति के सरीर की’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(ii) यमक अलंकार" },
  { q: "‘यह देखिये , अरविन्द – शिशु वृन्द कैसे सो रहे।’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(iii) उपमा अलंकार" },
  { q: "‘हनुमान की पूंछ में लगन न पाई आग, लंका सिगरी जल गई गए निशाचर भाग।’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) यमक अलंकार", "(iii) अतिश्योक्ति अलंकार", "(iv) रूपक अलंकार"], a: "(iii) अतिश्योक्ति अलंकार" },
  { q: "‘जगी वनस्पतियाँ अलसाई मुह धोया शीतल जल से।’ में कौन सा अलंकार है।", o: ["(i) मानवीकरण अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(i) मानवीकरण अलंकार" },
  { q: "‘कल कानन कुंडल मोर पखा उर पे बनमाल विराजती है’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(i) अनुप्रास अलंकार" },
  { q: "‘सागर के उर पर नाच-नाच करती हैं लहरें मधुर गान।’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) मानवीकरण अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(ii) मानवीकरण अलंकार" },
  { q: "‘कनक कनक ते सौगुनी मादकता अधिकाय। या खाए बौरात नर या पा बौराय।’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) अतिश्योक्ति अलंकार", "(iii) उपमा अलंकार", "(iv) यमक अलंकार"], a: "(iv) यमक अलंकार" },
  { q: "‘नदियां जिनकी यशधारा सी बहती है अब निशि -वासर’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(iii) उपमा अलंकार" },
  { q: "‘प्रश्न चिन्हों में उठी हैं भाग्य-सागर की हिलोंरे।’ में कौन सा अलंकार है।", o: ["(i) अतिश्योक्ति अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(iv) रूपक अलंकार" },
  { q: "‘मैं बरजी कैबार तू, इतकत लेती करौंट। पंखुरी लगे गुलाब की, परि है गात खरौंट।’ में कौन सा अलंकार है।", o: ["(i) अतिश्योक्ति अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(i) अतिश्योक्ति अलंकार" },
  { q: "‘लोने-लोने वे घने चने क्या बने-बने इठलाते हैं, हौले-हौले होली गा-गा धुंघरू पर ताल बजाते हैं।’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) मानवीकरण अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(ii) मानवीकरण अलंकार" },
  { q: "‘कालिंदी कूल कदंब की डारिन’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(i) अनुप्रास अलंकार" },
  { q: "‘पीपर पात सरिस मन डोला’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(iii) उपमा अलंकार" },
  { q: "‘काली घटा का घमंड घटा।’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(ii) यमक अलंकार" },
  { q: "‘बहुरि बदन-बिधु अंचल ढाँकी।’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(iv) रूपक अलंकार" },
  { q: "‘बाँधा था विधु को किसने इन काली ज़ंजीरों में, मणिवाले फणियों का मुख क्यों भरा हुआ है हीरों से।’ में कौन सा अलंकार है।", o: ["(i) अतिश्योक्ति अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(i) अतिश्योक्ति अलंकार" },
  { q: "‘है वसुंधरा बिखेर देती मोती सबके सोने पर। रवि बटोर लेता है उसको सदा सवेरा होने पर।’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) मानवीकरण अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(ii) मानवीकरण अलंकार" },
  { q: "‘कूकै लगी कोयल कदंबन पर बैठी फेरि।’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(i) अनुप्रास अलंकार" },
  { q: "‘उदित उदय गिरि-मंच पर रघुबर-बाल पतंग, बिकसे संत-सरोज सब हरषे लोचन-भृंग।’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(iv) रूपक अलंकार" },
  { q: "‘ऊँचे घोर मन्दर के अन्दर रहन वारी। ऊँचे घोर मन्दर के अन्दर रहाती है।’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(ii) यमक अलंकार" },
  { q: "‘देखि सुदामा की दीन दशा करुना करिके करुना निधि रोए।’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) यमक अलंकार", "(iii) उपमा अलंकार", "(iv) अतिश्योक्ति अलंकार"], a: "(iv) अतिश्योक्ति अलंकार" },
  { q: "‘लो यह लतिका भी भर लाई, मधु मुकुल नवल रस गागरी।’ में कौन सा अलंकार है।", o: ["(i) अनुप्रास अलंकार", "(ii) मानवीकरण अलंकार", "(iii) उपमा अलंकार", "(iv) रूपक अलंकार"], a: "(ii) मानवीकरण अलंकार" }
  
  ];
  
let currentQuestionIndex = 0;
let score = 0;

const questionElement = document.getElementById("question");
const optionsContainer = document.getElementById("options");
const nextButton = document.getElementById("next-btn");
const resultBox = document.getElementById("result-box");
const scoreElement = document.getElementById("score");

function loadQuestion() {
    const currentQuestion = quizData[currentQuestionIndex];
    questionElement.textContent = `${currentQuestionIndex + 1}. ${currentQuestion.q}`;
    optionsContainer.innerHTML = "";
    
    currentQuestion.o.forEach(option => {
        const button = document.createElement("button");
        button.textContent = option;
        button.classList.add("option");
        button.addEventListener("click", () => checkAnswer(button, currentQuestion.a));
        optionsContainer.appendChild(button);
    });

    nextButton.style.display = "none";
}

function checkAnswer(selectedButton, correctAnswer) {
    const buttons = document.querySelectorAll(".option");
    buttons.forEach(button => button.disabled = true);
    
    if (selectedButton.textContent === correctAnswer) {
        selectedButton.classList.add("correct");
        score++;
    } else {
        selectedButton.classList.add("wrong");
        buttons.forEach(button => {
            if (button.textContent === correctAnswer) button.classList.add("correct");
        });
    }
    
    nextButton.style.display = "block";
}

nextButton.addEventListener("click", () => {
    currentQuestionIndex++;
    if (currentQuestionIndex < quizData.length) {
        loadQuestion();
    } else {
        showResult();
    }
});

function showResult() {
    document.getElementById("quiz-box").classList.add("hide");
    resultBox.classList.remove("hide");
    scoreElement.textContent = score;
}

function restartQuiz() {
    currentQuestionIndex = 0;
    score = 0;
    resultBox.classList.add("hide");
    document.getElementById("quiz-box").classList.remove("hide");
    loadQuestion();
}

loadQuestion();

